# -*- coding: utf-8 -*-

# (цикл while)

# Ежемесячная стипендия студента составляет educational_grant руб., а расходы на проживание превышают стипендию
# и составляют expenses руб. в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца
# Составьте программу расчета суммы денег, которую необходимо единовременно попросить у родителей,
# чтобы можно было прожить учебный год (10 месяцев), используя только эти деньги и стипендию.
# Формат вывода:
#   Студенту надо попросить ХХХ.ХХ рублей

educational_grant, expenses = 10000, 12000

month = 9
get_sum = expenses - educational_grant
while month != 0:
    delta = expenses * 0.03  # Вычисляем сумму удорожания проживания
    expenses += delta
    get_sum += expenses - educational_grant
    month -= 1
print(f'Студенту надо попросить {get_sum:.2f}')
